// 2301089

#include <stdio.h>

int main(void){
    //整数型の変数を作成
    int in,buy,out,c500,c100,c50,c10,m500,m100,m50,m10;

    //投入金額と購入金額を入力
    scanf("%d",&in);
    scanf("%d",&buy);

    //お釣りの金額を求める
    out = in - buy;

    //500円玉で返却する金額の残りを計算
    c500 = out % 500;
    //500円玉の枚数を計算
    m500 = (out - c500) / 500;
    //100円玉で返却する金額の残りを計算
    c100 = c500 % 100;
    //100円玉の枚数を計算
    m100 = (c500 - c100) / 100;
    //50円玉で返却する金額の残りを計算
    c50 = c100 % 50;
    //50円玉の枚数を計算
    m50 = (c100 - c50) / 50;
    //10円玉で返却する金額の残りを計算
    c10 = c50 % 10;
    //10円玉の枚数を計算
    m10 = (c50 - c10) / 10;

    //それぞれの硬貨の枚数を出力
    printf("500:%d\n",m500);
    printf("100:%d\n",m100);
    printf(" 50:%d\n",m50);
    printf(" 10:%d\n",m10);

    return 0;
}